/*
todo1.重组割草黄金国

todo2.复习线性代数（期间观看mit线代网课）
*1.行列式（1.2）//!ok
*2.矩阵运算（1.3）//!ok
*3.向量组线性相关性（1.3）//!ok
*4.特征值与特征向量（1.4）//!ok
*5.矩阵相似对角化（1.4）//!ok
*6.二次型（1.5）//!ok
*7.线性空间（1.5）//!ok

todo3.复习高数
*1.极限，函数
*2.导数
*3.微分中值定理，泰勒公式，洛必达法则，弧微分
*4.定积分，不定积分，积分中值定理，求积分（凑微分法，换元法，分部积分法），反常积分及其敛散性判定，积分应用（求旋转体体积，包围面积，弧长）
*5.级数，级数敛散性判定，绝对值级数，交错级数，幂级数，泰勒级数，求级数收敛域，收敛半径，级数和函数，傅立叶级数(1.8之前)

todo4.准备中期视频定位点检测
!之后的任务1：试验sobel算子的边缘检测与角点检测效果（1.5之前）
!          2：如果可能的话，修正角点检测算子的赋值问题（可延后）(新方法 get)
!          3：透视变换（1.6之前）
!          4:tdtcamara相机api深入了解（1.7之前）
!          5:读相关论文，看apriltag相关api，并快速移植到c++，识别出定位点到无人机相机的距离（1.16之前）
!          6：利用opencv ml或者找lyl一起完成模板匹配or机器学习部分，识别出定位点类型（1.25之前）
!          7：完成最后的解算，得到无人机在全场的相对位置（1.28之前）

todo5.游戏王印卡排版系统制作（c&c++,opencv）（闲暇时间制作，1.15之前完成）

todo6.

**/